lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb_host.c
            if (USB_OTG_H_ReadTxQueueRemainSpace(usbhh->usbHost) == 0)
            {
                usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_RESET;
                usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_SET;

                while (usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN)
                {
                    timeout++;

                    if (timeout >= 0x400)
                    {
                        break;
                    }
                }
            }
            else
            {
                usbhh->usbHost->REGS_HCH[chNum].HCH_B.CHEN = BIT_SET;
            }
            break;
    }
}

/*!
 * @brief     Handle Host port in interrupt
 *
 * @param     usbhh: USB host handler.
 *
 * @param     channelNum : Select channel.
 *
 * @retval    None
 */
static void USBH_IN_HostChannelIsrHandler(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    /* AHB Error only in HS mode*/
    if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_AHBERR))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_AHBERR);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_XACTERR;
    }
    /* Babble Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_BABBLE))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_BABBLE);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_BBLERR;
    }
    /* ACK Response Received / Transmitted */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXTXACK))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXTXACK);
    }
    /* STALL Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXSTALL))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXSTALL);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_STALL;
    }
    /* Data Toggle Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_DTOG))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_DTOG);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_DATATGLERR;
    }
    /* Transaction Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TERR))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TERR);
        USB_OTG_H_HaltChannel(usbhh, channelNum);

        usbhh->xferPipe[channelNum].pipeState = PIPE_XACTERR;
    }
    /* Frame Overrun Error */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_FOVR))
    {
        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_FOVR);
        USB_OTG_H_HaltChannel(usbhh, channelNum);
    }
    /* Transfer Complete Normally */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPN))
    {
        if (usbhh->usbCfg.dmaStatus != DISABLE)
        {
            usbhh->xferPipe[channelNum].bufCount = usbhh->xferPipe[channelNum].bufSize - \
                                                   USB_OTG_H_ReadTransferSize(usbhh->usbHost, channelNum);
        }

        usbhh->xferPipe[channelNum].pipeState = PIPE_XFRC;
        usbhh->xferPipe[channelNum].errorCnt = 0;

        switch (usbhh->xferPipe[channelNum].epType)
        {
            case EP_TYPE_CONTROL:
            case EP_TYPE_BULK:
                USB_OTG_H_HaltChannel(usbhh, channelNum);
                USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK);
                break;

            case EP_TYPE_INTERRUPT:
            case EP_TYPE_ISO:
                USB_OTG_H_TxUseOddFrame(usbhh->usbHost, channelNum);
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_OK;

                /* USB update URB status callback */
                USBH_UpdateUrbCallback(usbhh);
                break;

            default:
                break;
        }

        if (usbhh->usbCfg.dmaStatus == ENABLE)
        {
            if (((usbhh->xferPipe[channelNum].bufSize / \
                    usbhh->xferPipe[channelNum].maxPackSize) & 0x01) != 0)
            {
                usbhh->xferPipe[channelNum].pidToggleIn ^= 1;
            }
        }
        else
        {
            usbhh->xferPipe[channelNum].pidToggleIn ^= 1;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPN);
    }
    /* Transfer Complete Abnormally */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPAN))
    {
        switch (usbhh->xferPipe[channelNum].pipeState)
        {
            case PIPE_XFRC:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_OK;
                break;

            case PIPE_STALL:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_STALL;
                break;

            case PIPE_XACTERR:
            case PIPE_DATATGLERR:
                usbhh->xferPipe[channelNum].errorCnt++;
                if (usbhh->xferPipe[channelNum].errorCnt >= 3)
                {
                    usbhh->xferPipe[channelNum].errorCnt = 0;
                    usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;
                }
                else
                {
                    usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;

                    /* reactivate the host channel */
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHINT = BIT_RESET;
                    usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHEN = BIT_SET;
                }
                break;

            case PIPE_NAK:
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_NOREADY;

                /* reactivate the host channel */
                usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHINT = BIT_RESET;
                usbhh->usbHost->REGS_HCH[channelNum].HCH_B.CHEN = BIT_SET;
                break;

            case PIPE_BBLERR:
                usbhh->xferPipe[channelNum].errorCnt++;
                usbhh->xferPipe[channelNum].urbStatus = USB_URB_ERROR;
                break;

            default:
                break;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_TSFCMPAN);

        /* USB update URB status callback */
        USBH_UpdateUrbCallback(usbhh);
    }
    /* NAK Response Received */
    else if (USB_OTG_H_ReadChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK))
    {
        switch (usbhh->xferPipe[channelNum].epType)
        {
            case EP_TYPE_CONTROL:
            case EP_TYPE_BULK:
                usbhh->xferPipe[channelNum].errorCnt = 0;

                if (usbhh->usbCfg.dmaStatus == DISABLE)
                {
                    usbhh->xferPipe[channelNum].pipeState = PIPE_NAK;
                    USB_OTG_H_HaltChannel(usbhh, channelNum);
                }
                break;

            case EP_TYPE_INTERRUPT:
                usbhh->xferPipe[channelNum].errorCnt = 0;
                USB_OTG_H_HaltChannel(usbhh, channelNum);
                break;

            default:
                break;
        }

        USB_OTG_H_ClearChannelIntFlag(usbhh->usbHost, channelNum, CHANNEL_INT_RXNAK);
    }
    else
    {

