lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb_host.c
    return xferSize;
}

/*!
 * @brief     USB OTG host read toggle of channel
 *
 * @param     usbhh: USB host handler
 *
 * @param     channelNum: channel number
 *
 * @retval    xfer size
 */
uint8_t USBH_OTG_ReadToggle(USBH_HANDLE_T* usbhh, uint8_t channelNum)
{
    uint8_t toggle;

    if (usbhh->xferPipe[channelNum].epDir)
    {
        toggle = usbhh->xferPipe[channelNum].pidToggleIn;
    }
    else
    {
        toggle = usbhh->xferPipe[channelNum].pidToggleOut;
    }

    return toggle;
}

/*!
 * @brief     USB OTG host configure toggle of channel
 *
 * @param     usbhh: USB host handler
 *
 * @param     channelNum: channel number
 *
 * @param     toggle: toggle
 *
 * @retval    None
 */
void USBH_OTG_ConfigToggle(USBH_HANDLE_T* usbhh, uint8_t channelNum, uint8_t toggle)
{
    if (usbhh->xferPipe[channelNum].epDir)
    {
        usbhh->xferPipe[channelNum].pidToggleIn = toggle;
    }
    else
    {
        usbhh->xferPipe[channelNum].pidToggleOut = toggle;
    }
}

/*!
 * @brief     Config the USB host peripheral according to the specified parameters
 *
 * @param     usbhh: USB host handler
 *
 * @retval    None
 */
void USBH_Config(USBH_HANDLE_T* usbhh)
{
    uint8_t i;

    /* Embedded PHY */
    if (usbhh->usbCfg.phyType == USB_OTG_PHY_EMB)
    {
        /* Embedded FS PHY */
        if(usbhh->usbCfg.speed == USB_OTG_SPEED_FSLS)
        {
            USB_OTG_ConfigPHY(usbhh->usbGlobal, USB_OTG_PHY_SP_FS);

            /* Reset core */
            USB_OTG_CoreReset(usbhh->usbGlobal);
            USBH_UserDelayCallback(usbhh,50);

            /* battery status */
            if (usbhh->usbCfg.batteryStatus == ENABLE)
            {
                /* Activate the power down*/
                USB_OTG_EnablePowerDown(usbhh->usbGlobal);
            }
            else
            {
                /* Deactivate the power down*/
                USB_OTG_DisablePowerDown(usbhh->usbGlobal);
            }
        }
    }
    /* External PHY */
    else
    {
        /* Activate the power down*/
        USB_OTG_EnablePowerDown(usbhh->usbGlobal);

        USB_OTG_ConfigPHY(usbhh->usbGlobal, USB_OTG_PHY_SP_HS);

        usbhh->usbGlobal->GUSBCFG_B.DPSEL       = BIT_RESET;
        usbhh->usbGlobal->GUSBCFG_B.ULPISEL     = BIT_RESET;

        usbhh->usbGlobal->GUSBCFG_B.ULPIEVDSEL  = BIT_RESET;
        usbhh->usbGlobal->GUSBCFG_B.ULPIEVC     = BIT_RESET;

        if (usbhh->usbCfg.extVbusStatus == ENABLE)
        {
            usbhh->usbGlobal->GUSBCFG_B.ULPIEVDSEL = BIT_SET;
        }

        /* Reset core */
        USB_OTG_CoreReset(usbhh->usbGlobal);
        USBH_UserDelayCallback(usbhh,50);
    }

    if (usbhh->usbCfg.dmaStatus == ENABLE)
    {
        USB_OTG_SetBurstLenght(usbhh->usbGlobal, USB_OTG_BURST_INCR4);

        USB_OTG_EnableDMA(usbhh->usbGlobal);
    }

    /* Device mode or host mode */
    USB_OTG_ConfigMode(usbhh->usbGlobal, usbhh->usbCfg.mode);
    
    /* PHY Clock restart */
    usbhh->usbPower->PCGCTRL = 0;

    /* VBUS Sensing Disable */
    usbhh->usbGlobal->GGCCFG_B.VBSDIS = BIT_SET;
    usbhh->usbGlobal->GGCCFG_B.ADVBSEN = BIT_RESET;
    usbhh->usbGlobal->GGCCFG_B.BDVBSEN = BIT_RESET;

    /* Set host speed support */
    usbhh->usbHost->HCFG &= ~BIT2;

    /* Flush all Tx and Rx FIFOs */
    USB_OTG_FlushTxFIFO(usbhh->usbGlobal, 0x10);
    USB_OTG_FlushRxFIFO(usbhh->usbGlobal);

    /* Clear all Channel Interrupts */
    for (i = 0; i < usbhh->usbCfg.hostChannelNum; i++)
    {
        USB_OTG_H_ClearAllChannelIntFlag(usbhh->usbHost, i);
    }

    USB_OTG_DisableAllGlobalInterrupt(usbhh->usbGlobal);

    USB_OTG_ClearGlobalIntFlag(usbhh->usbGlobal, 0xFFFFFFFF);

    /* Configure RX FIFO */
    if (usbhh->usbCfg.speed == USB_OTG_SPEED_FSLS)
    {
        USB_OTG_ConfigRxFifoSize(usbhh->usbGlobal, USBH_FS_RX_FIFO_SIZE);
        usbhh->usbGlobal->GTXFCFG_H_B.NPTXSA       = USBH_FS_RX_FIFO_SIZE;
        usbhh->usbGlobal->GTXFCFG_H_B.NPTXFDEP     = USBH_FS_HNP_TXH_FIFO_SIZE;
        usbhh->usbGlobal->GHPTXFSIZE_B.HPDTXFSA    = USBH_FS_HP_TXH_FIFO_SA;
        usbhh->usbGlobal->GHPTXFSIZE_B.HPDTXFDEP   = USBH_FS_HP_TXH_FIFO_SIZE;
    }
    else
    {
        USB_OTG_ConfigRxFifoSize(usbhh->usbGlobal, USBH_HS_RX_FIFO_SIZE);
        usbhh->usbGlobal->GTXFCFG_H_B.NPTXSA       = USBH_HS_RX_FIFO_SIZE;
        usbhh->usbGlobal->GTXFCFG_H_B.NPTXFDEP     = USBH_HS_HNP_TXH_FIFO_SIZE;
        usbhh->usbGlobal->GHPTXFSIZE_B.HPDTXFSA    = USBH_HS_HP_TXH_FIFO_SA;
        usbhh->usbGlobal->GHPTXFSIZE_B.HPDTXFDEP   = USBH_HS_HP_TXH_FIFO_SIZE;
    }

    if (usbhh->usbCfg.dmaStatus == DISABLE)
    {
        usbhh->usbGlobal->GINTMASK |= USB_INT_G_RXFNONE;
    }

    /* Enable the common interrupts */
    usbhh->usbGlobal->GINTMASK |= (USB_INT_G_HPORT     |
                                   USB_INT_G_HCHAN     |
                                   USB_INT_G_SOF       |
                                   USB_INT_G_DEDIS     |
                                   USB_INT_G_IP_OUTTX  |
                                   USB_INT_G_RWAKE);
}

/*!
 * @brief       USB host URB status update event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_UpdateUrbCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host connect event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_ConnectCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host disconnect event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_DisconnectCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host port enable event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_PortEnableCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host port disable event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_PortDisableCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host SOF event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_SOFCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host hardware reset event callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @retval      None
 */
__weak void USBH_HardwareResetCallback(USBH_HANDLE_T* usbhh)
{
    UNUSED(usbhh);
    /* callback interface */
}

/*!
 * @brief       USB host delay callback function
 *
 * @param       usbhh: USB host handler.
 *
 * @param       nms: number of milliseconds to delay
 *
 * @retval      None
 */
__weak void USBH_UserDelayCallback(USBH_HANDLE_T* usbhh, uint32_t nms)
{
    UNUSED(usbhh);
    UNUSED(nms);
    /* callback interface */
}
/**@} end of group USB_Host_Functions*/
/**@} end of group USB_Host_Driver*/
/**@} end of group APM32F402_403_StdPeriphDriver*/
